<template>
    <div class="lunbo">
        <dv-scroll-board :config="config" style="width:100%;height:100%" />
    </div>
</template>

<script>
    export default {
        name: "lunbo1",
        created() {
            this.config = {
                waitTime:800,
                header: ['班次','饲料名称','计划量（KG）','执行量（KG）','执行情况','操作时间'],
                data: [
                    ['早班','米','4','61.79','已经执行','8:44'],
                    ['早班','稻草','40','61.79','已经执行','8:44'],
                    ['早班','稻草','400','610.79','已经执行','8:44'],
                    ['中班','米','4','61.79','尚未执行','8:44'],
                    ['中班','稻草','40','61.79','尚未执行','8:44'],
                    ['中班','稻草','400','610.79','尚未执行','8:44'],
                    ['晚班','米','4','61.79','尚未执行','8:44'],
                    ['晚班','稻草','40','61.79','尚未执行','8:44'],
                    ['晚班','稻草','400','610.79','尚未执行','8:44'],
                ] }
        }
    }
</script>

<style scoped>
   .lunbo{
      position: absolute;
      top: 3%;
       left: 1%;
       bottom: 5%;
       right: 1%;
   }
</style>
